((((λ (Y-comb)
      (λ (asd)
        (λ (wer)
          ((λ (f)
             (f
              (λ (f)
                (λ (x)
                  (f
                   (f
                    (f
                     (f
                      (f
                       (f
                        (f
                         (f
                          (f
                           (f
                            (f
                             (f
                              (f
                               (f
                                (f
                                 (f
                                  (f
                                   (f
                                    (f (f (f (f (f x)))))))))))))))))))))))))))
           (Y-comb
            (λ (f)
              (λ (x)
                (((wer x) (λ (_) (λ (f) (λ (x) x))))
                 (λ (_) (f (asd x)))))))))))
    ((λ (u) (u u))
     (λ (y) (λ (mk) (mk (λ (x) (((y y) mk) x)))))))
   (λ (n0)
     (λ (f)
       (λ (y)
         (((n0 (λ (g) (λ (h) (h (g f))))) (λ (_) y))
          (λ (x) x))))))
  (λ (n0)
    ((n0 (λ (b) (λ (tt) (λ (ft) (ft (λ (_) _))))))
     (λ (tt) (λ (ft) (tt (λ (_) _)))))))
